{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 128, 44, 1], "dtype": "float32", "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wMAAAAAAAAABAAAAAUAAABDAAAAc34AAAB0AHwBgwFkAWsCcxB0AYIBdAB8AWQCGQCDAWQBawJz\nJHQBggF0AHwBZAMZAIMBZAFrAnM4dAGCAXQCfAKDAX0CZAJkAmcCdAN8AWQCGQCDAXQDfAFkAxkA\ngwFkAmQCZwJnBH0DdAR8A3wCZAVkBI0DfQN0BWoGfAB8A4MCUwApBuFxAQAAUGFkcyB0aGUgMm5k\nIGFuZCAzcmQgZGltZW5zaW9ucyBvZiBhIDREIHRlbnNvci4KCiAgICAjIEFyZ3VtZW50cwogICAg\nICAgIHg6IFRlbnNvciBvciB2YXJpYWJsZS4KICAgICAgICBwYWRkaW5nOiBUdXBsZSBvZiAyIHR1\ncGxlcywgcGFkZGluZyBwYXR0ZXJuLgogICAgICAgIGRhdGFfZm9ybWF0OiBzdHJpbmcsIGAiY2hh\nbm5lbHNfbGFzdCJgIG9yIGAiY2hhbm5lbHNfZmlyc3QiYC4KCiAgICAjIFJldHVybnMKICAgICAg\nICBBIHBhZGRlZCA0RCB0ZW5zb3IuCgogICAgIyBSYWlzZXMKICAgICAgICBWYWx1ZUVycm9yOiBp\nZiBgZGF0YV9mb3JtYXRgIGlzIG5laXRoZXIgYCJjaGFubmVsc19sYXN0ImAgb3IgYCJjaGFubmVs\nc19maXJzdCJgLgogICAg6QIAAADpAAAAAOkBAAAAKQHaDHNwYXRpYWxfYXhlcykCcgQAAAByAgAA\nACkH2gNsZW7aDkFzc2VydGlvbkVycm9y2hVub3JtYWxpemVfZGF0YV9mb3JtYXTaBGxpc3TaD3Ry\nYW5zcG9zZV9zaGFwZdoCdGbaA3BhZCkE2gF42gdwYWRkaW5n2gtkYXRhX2Zvcm1hdNoHcGF0dGVy\nbqkAchEAAAD6X0M6XFVzZXJzXGdqY29sXEFuYWNvbmRhM1xlbnZzXElSX0dQVV9wbG90XGxpYlxz\naXRlLXBhY2thZ2VzXGtlcmFzXGJhY2tlbmRcdGVuc29yZmxvd19iYWNrZW5kLnB52hJzcGF0aWFs\nXzJkX3BhZGRpbmfXCAAAcxQAAAAADhABFAEUAQgCBgEKAQoBCgEOAQ==\n", [[[1, 1], [1, 1]], null], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.33000001311302185}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 11, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}